# Desafío Guiado 1.

Pregunta 1:

In [6]:
print("Hola Mundo, esta es mi primera incursión en Python ")

Hola Mundo, esta es mi primera incursión en Python

Pregunta 2:

In [7]:
name = 'Simón Nanjarí'
edad = 33
actividades_favoritas = ["jugar en la pc", "ver series", "salir en bicicleta"]
mascotas = True

Pregunta 3:

In [9]:
print(name)
print(edad)
print(actividades_favoritas[1])
print(mascotas)

Simón Nanjarí
33
ver series
True

In [13]:
print(type(name))
print(type(edad))
print(type(actividades_favoritas[1]))
print(type(mascotas))

<class 'str'>
<class 'int'>
<class 'str'>
<class 'bool'>

In [19]:
print('Holaaaaa!. Mi nombre es ' + str(name) + ' yo tengo ' + str(edad) + ' mis actividades favoritas son ' + str(actividades_favoritas) + ' y tengo 3 mascotas')

Holaaaaa!. Mi nombre es Simón Nanjarí yo tengo 33 mis actividades favoritas son ['jugar en la pc', 'ver series', 'salir en bicicleta'] y tengo 3 mascotas

Pregunta 4: Identificar códigos erróneos.

In [20]:
# 1) print('Estaba la pájara pinta sentada en el verde limón) ===>> para realizar la impresión de esta solicitud, se debe iniciar y cerrar con comillas el print.
# 2) print('Mi nombre es' name 'y tengo' edad, 'años') ===>> para realizar la impresión de esta solicitud, es debido ponerles un "+" así incorporar las variables como 'nombre' o 'edad' de forma correcta.
# 3) import pandas as pd  =====>> no presenta error ya que Pandas generalmente se importa con el alias pd en Python.
#    import numpy as np =====>> no presenta error ya que NumPy generalmente se importa con el alias np en Python.
# 4) "Ornitorrinco" + 45 ===>> genera error de tipo!, ya que no se puede concatenar una variable Str con un Int.

Pregunta 5:

In [25]:
import pandas as pd
import numpy as np

In [27]:
pd.read_csv('flights.csv')

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [28]:
df = pd.read_csv('flights.csv')

In [42]:
df[:5]

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [41]:
df[139:]

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [68]:
df.describe()

              year  passengers
count   144.000000  144.000000
mean   1954.500000  280.298611
std       3.464102  119.966317
min    1949.000000  104.000000
25%    1951.750000  180.000000
50%    1954.500000  265.500000
75%    1957.250000  360.500000
max    1960.000000  622.000000

In [49]:
df.value_counts()

year  month      passengers
1949  April      129           1
      August     148           1
1956  May        318           1
      November   271           1
      October    306           1
                              ..
1953  April      235           1
      August     272           1
      December   201           1
      February   196           1
1960  September  508           1
Length: 144, dtype: int64

In [55]:
las_primeras_15 = df[:15]
print(las_primeras_15)

    year      month  passengers
0   1949    January         112
1   1949   February         118
2   1949      March         132
3   1949      April         129
4   1949        May         121
5   1949       June         135
6   1949       July         148
7   1949     August         148
8   1949  September         136
9   1949    October         119
10  1949   November         104
11  1949   December         118
12  1950    January         115
13  1950   February         126
14  1950      March         141

In [59]:
las_ultimas_15 = df[129:]
print(las_ultimas_15)

     year      month  passengers
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [62]:
np.mean(df['passengers'])

280.2986111111111

In [63]:
np.median(df['passengers'])

265.5

In [64]:
np.std(df['passengers'])

119.54904153277148

In [69]:
np.mean(las_primeras_15['passengers'])

126.8

In [70]:
np.median(las_primeras_15['passengers'])

126.0

In [71]:
np.std(las_primeras_15['passengers'])

12.681745410891462

In [72]:
np.mean(las_ultimas_15['passengers'])

459.2

In [73]:
np.median(las_ultimas_15['passengers'])

432.0

In [74]:
np.std(las_ultimas_15['passengers'])

75.29426715671431

In [ ]:
#Comentarios:
#Se puede ver claramente que entre la Media y Mediana no existe tanta diferencia, ya sea, para los primeros 15 y últimos 15 regístros. Sin embargo, la Desviasión Estandar (std), se aleja bastante de los regístros ateriores. Esto, se debe a que los datos se encuentran con una leve dispersión, concentrandose regularmente más hacia el centro de la tabla a trabajar.